{
  "header": {
    "name": "Heitor Chang",
    "email": "heitorpontual@gmail.com",
    "telephone": "(11) 99907-4867",
    "website": "https://heitorchang.github.io/"
  },
  "professional_experience": [
    {
      "company": "Tempo OK Tecnologia em Meteorologia Ltd.",
      "location": "São Paulo, SP",
      "jobs": [
        {
          "job_title": "Senior Full-Stack Developer",
          "time_frame": "June 2020 &mdash; now",
          "duties": [
            "Built and administered the public-facing website with Django, including custom user management and authentication with a JWT extension.",
            "Architected a PostgreSQL database in Google Cloud Platform to store meteorological observation and forecast time series at client-supplied locations and at government-operated stations.",
            "Built Flask and FastAPI endpoints to communicate with the SQL database using Google Cloud Functions and Cloud Run services, leveraging Docker containers and Bitbucket's automated Continuous Deployment pipeline.",
            "Created a geospatial dashboard containing satellite imagery overlays computed from NASA's scientific data and weather stations' historical data, obtained by accessing their public APIs.",
            "Created a hydroelectric energy forecasting dashboard containing Google Maps and Apache ECharts widgets in Vue.js and the Vuetify Material Design front-end framework.",
            "Developed a Markdown-based application for documentation and created a Stack Overflow for Teams account to streamline the organization of internal processes and common information."
          ]
        }
      ]
    },
    {
      "company": "Pontual Export &amp; Import Ltd.",
      "location": "São Paulo, SP",
      "jobs": [
        {
          "job_title": "Full-Stack Developer",
          "time_frame": "Jan. 2014 &mdash; June 2020",
          "duties": [
            "Used MA (Moving Average) indicators in a Django and Python project to predict the demand of 600 products and calculated appropriate amounts for restocking.",
            "Created a REST API with the Slim micro framework in PHP to be consumed by a React app that rendered the company's website.",
            "Visualized historical sales with NumPy and Pandas, reporting totals, averages, and outliers for each product.",
            "Created a Single-Page App with AngularJS and Firebase to organize product reservations by clients and their assigned salesperson in real time."
          ]
        },
        {
          "job_title": "Sales Analyst",
          "time_frame": "Nov. 2011 &mdash; Jan. 2014",
          "duties": [
            "Fulfilled client orders and reservations and formalized them upon delivery.",
            "Prepared sales forecasts in Excel for the best-selling products and summarized business-critical statistics."
          ]
        }
      ]
    },
    {
      "company": "Merrill Lynch &amp; Co., Inc.",
      "location": "New York, NY",
      "jobs": [
        {
          "job_title": "Summer Associate in Global Research",
          "time_frame": "June 2008 &mdash; Aug. 2008",
          "duties": [
            "Modeled the prepayment speeds of mortgage revenue bonds and calculated their prices and risk profiles.",
            "Backtested the performance of a cash-collaterized portfolio of futures as a potential new product.",
            "Compared the returns and volatility of crude oil futures relative to large-cap refinery equities."
          ]
        }
      ]
    },
  ],
  "education": [
    {
      "school": "New York University",
      "location": "New York, NY",
      "degrees": [
        {
          "degree": "M.S. in Mathematics in Finance",
          "time_frame": "Sept. 2007 &mdash; Jan. 2009",
          "gpa": "3.4/4.0"
        }
      ]
    },
    {
      "school": "Stanford University",
      "location": "Stanford, CA",
      "degrees": [
        {
          "degree": "M.S. in Materials Science and Engineering",
          "time_frame": "Sept. 2005 &mdash; June 2007",
          "gpa": "3.6/4.0"
        },
        {
          "degree": "B.S. in Mathematical and Computational Sciences",
          "time_frame": "Sept. 2001 &mdash; Jan. 2005",
          "gpa": "3.7/4.0"
        },
      ]
    },
  ],
  "languages": [
    "Fluent in English and Portuguese. Basic knowledge of Spanish, French, Italian, Mandarin, and Modern Greek.",
    "Advanced knowledge of Python, JavaScript and HTML.",
    "Intermediate knowledge of PHP, CSS and PostgreSQL.",
    "Basic knowledge of Common Lisp and Clojure."
  ],
}
